Repository: Pierre-Sassoulas/django-zxcvbn-password-validator
Catalog: django_zxcvbn_password_validator/locale/*/LC_MESSAGES/django.po
Languages: fr, hu, nl, pt_br

source: Use a few words, avoid common phrases
fr: Utilisez quelques mots, évitez les mots souvent utilisés ensemble
hu: Használjon néhány szót, kerülve a gyakori kifejezéseket
nl: Gebruik een paar woorden, vermijd veelvoorkomende zinnen
pt_br: Use algumas palavras, evite palavras geralmente utilizadas em conjunto

source: No need for symbols, digits, or uppercase letters
fr: Pas besoin de symboles, nombres, ou lettres majuscules
hu: Ne használjon szimbólumokat, számokat vagy nagybetűket
nl: Symbolen, cijfers of hoofdletters zijn niet noodzakelijk
pt_br: Não é necessário utilizar símbolos, números ou letras maiúsculas

source: Add another word or two. Uncommon words are better.
fr: Ajoutez un ou deux autres mots. Les mots les moins courants sont les meilleurs.
hu: Egészítse ki egy-két további, kevésbé hétköznapi szóval.
nl: Voeg nog een woord of twee toe. Ongewone woorden zijn beter.
pt_br: Adicione uma ou duas palavras. Dê preferência palavras pouco usadas.

source: Straight rows of keys are easy to guess
fr: Les alignements de touches sont faciles à deviner
hu: Az egymás melletti billentyűk egyenes sorai könnyen kitalálhatók
nl: Opeenvolgende toetsen zijn eenvoudig te raden
pt_br: Teclas em sequência são fáceis de adivinhar

source: Short keyboard patterns are easy to guess
fr: Les motifs sur le clavier sont faciles à deviner s'ils sont courts
hu: A rövid billentyűzetminták könnyen megfejthetők
nl: Korte patronen van het toetsenbord zijn eenvoudig te raden
pt_br: Padrões curtos de teclas são fáceis de adivinhar

source: Use a longer keyboard pattern with more turns
fr: Utilisez un motif plus long sur le clavier, avec plus de changement de direction
hu: Használjon hosszabb, több irányváltást tartalmazó billentyűzetmintát
nl: Gebruik een langer toetsenbordpatroon met meer bochten
pt_br: Use mais teclas e mudando a direção

source: Repeats like "aaa" are easy to guess
fr: Les répétitions du type "aaa" sont faciles à deviner
hu: Az ismétlődések, mint például az „aaa”, könnyen feltörhetők
nl: Herhalingen zoals "aaa" zijn eenvoudig te raden
pt_br: Repetições como "aaa" são fáceis de adivinhar

source: Repeats like "abcabcabc" are only slightly harder to guess than "abc"
fr: Les répétitions du type "abcabcabc" sont à peine plus dures à deviner que "abc"
hu: Az ismétlődő sorozatok, mint az „abcabcabc”, alig nehezebben megfejthetők, mint maga az „abc”
nl: Herhalingen zoals "abcabcabc" zijn maar een klein beetje moeilijker te raden dan "abc"
pt_br: Repetições como "abcabcabc" são apenas um pouco mais difíceis de adivinhar do que "abc"

source: Avoid repeated words and characters
fr: Évitez de répéter des mots ou des caractères
hu: Kerülje az ismétlődő szavakat és karaktereket
nl: Vermijd herhalingen van woorden en karakters
pt_br: Evite palavras ou caracteres repetidos

source: Sequences like "abc" or "6543" are easy to guess
fr: Les séquences du type "abc" ou "6543" sont faciles à deviner
hu: Az egymást követő sorozatok, például az „abc” vagy a „6543”, könnyen kitalálhatók
nl: Reeksen zoals "abc" of "6543" zijn eenvoudig te raden
pt_br: Sequências como "abc" ou "6543" são fáceis de adivinhar

source: Avoid sequences
fr: Évitez les séquences
hu: Kerülje az ilyen sorozatokat
nl: Vermijd reeksen
pt_br: Evite sequências

source: Recent years are easy to guess
fr: Les années récentes sont faciles à deviner
hu: A közelmúlt évei könnyen kitalálhatók
nl: Recente jaartallen zijn eenvoudig te raden
pt_br: Anos recentes são fáceis de adivinhar

source: Avoid recent years
fr: Évitez les années récentes
hu: Kerülje a közelmúlt éveinek használatát
nl: Vermijd recente jaartallen
pt_br: Evite anos recentes

source: Avoid years that are associated with you
fr: Évitez les années associés aux événements de votre vie
hu: Kerülje az Önnel kapcsolatba hozható éveket
nl: Vermijd jaartallen die met jou zijn geassocieerd
pt_br: Evite anos associados a você

source: Dates are often easy to guess
fr: Les dates sont souvent faciles à deviner
hu: A dátumok gyakran könnyen kitalálhatók
nl: Data zijn vaak eenvoudig te raden
pt_br: Datas geralmente são fáceis de adivinhar

source: Avoid dates and years that are associated with you
fr: Évitez les dates et les années associées aux événements de votre vie
hu: Kerülje az Önnel összefüggő dátumok és évek használatát
nl: Vermijd data en jaren die met je zijn geassocieerd
pt_br: Evite datas e anos associados a você

source: This is a top-10 common password
fr: C'est l'un des 10 mot de passe les plus courants
hu: Ez egy tíz leggyakoribb jelszó közé tartozó kifejezés
nl: Dit is een top-10 veelvoorkomend wachtwoord
pt_br: Essa é uma das 10 senhas mais comuns

source: This is a top-100 common password
fr: C'est l'un des 100 mot de passe les plus courants
hu: Ez egy száz leggyakoribb jelszó közé tartozó kifejezés
nl: Dit is een top-100 veelvoorkomend wachtwoord
pt_br: Essa é uma das 100 senhas mais comuns

source: This is a very common password
fr: C'est un mot de passe très courant
hu: Ez egy rendkívül elterjedt jelszó
nl: Dit is een veelvoorkomend wachtwoord
pt_br: Essa é uma senha muito comum

source: This is similar to a commonly used password
fr: C'est proche d'un mot de passe très courant
hu: Ez hasonlít egy gyakran használt jelszóra
nl: Dit lijkt te veel op een veelvoorkomend wachtwoord
pt_br: Essa é similar a uma senha muito comum

source: A word by itself is easy to guess
fr: Un mot isolé est facile à deviner
hu: Egyetlen szó önmagában könnyen kitalálható
nl: Een los woord is eenvoudig te raden
pt_br: Uma única palavra é fácil de adivinhar

source: Names and surnames by themselves are easy to guess
fr: Les noms et prénoms, pris de manière isolés, sont faciles à deviner
hu: A nevek és vezetéknevek önmagukban könnyen kitalálhatók
nl: Namen en achternamen op zich zijn eenvoudig te raden
pt_br: Nomes e sobrenomes são fáceis de adivinhar

source: Common names and surnames are easy to guess
fr: Les noms et prénoms courants sont faciles à deviner
hu: A gyakori nevek és vezetéknevek könnyen megfejthetők
nl: Veelvoorkomende namen en achternamen zijn eenvoudig te raden
pt_br: Nomes e sobrenomes comuns são fáceis de adivinhar

source: Capitalization doesn't help very much
fr: Utiliser des majuscules n'aide pas beaucoup
hu: A nagybetűs írásmód nem jelent jelentős védelmet
nl: Hoofdletters toevoegen helpt niet veel
pt_br: Usar maiúsculo só na primeira letra de uma palavra não ajuda muito

source: All-uppercase is almost as easy to guess as all-lowercase
fr: Tout-en-majuscule est à peine plus dur à deviner que tout-en-minuscule
hu: A teljesen nagybetűs írás majdnem olyan könnyen feltörhető, mint a kisbetűs
nl: Alles in hoofdletters is bijna even eenvoudig te raden als alles in kleine letters
pt_br: Usar maiúsculo em todas as letras é quase tão fácil de adivinhar quanto usar só minúsculo

source: Reversed words aren't much harder to guess
fr: Un mot écrit à l'envers n'est pas beaucoup plus dur à deviner
hu: A visszafelé írt szavak sem sokkal nehezebbek
nl: Woorden achterstevoren spellen is niet veel moeilijker te raden
pt_br: Palavras de trás para frente não são muito mais difíceis de adivinhar

source: Predictable substitutions like '@' instead of 'a' don't help very much
fr: Les substitutions prévisibles comme «@»à la place de «a» n'aident pas beaucoup
hu: Az előre látható helyettesítések, például az '@' az 'a' helyett, alig növelik a biztonságot
nl: Voorspelbare vervangingen zoals '@' in plaats van 'a' helpen niet veel
pt_br: Substituições previsíveis, como '@' ao invés de 'a', não ajudam muito

source: less than a second
fr: moins d'une seconde
hu: kevesebb mint egy másodperc
nl: minder dan één seconde
pt_br: Menos de um segundo

source: %d second
fr: %d seconde
hu: %d másodperc

source: %d minute
hu: %d perc

source: %d hour
fr: %d heure
hu: %d óra

source: %d day
fr: %d jour
hu: %d nap

source: %d month
fr: %d mois
hu: %d hónap

source: %d year
fr: %d année
hu: %d év

source: centuries
fr: siècles
hu: századok
nl: eeuwen
pt_br: séculos

source: Your password exceeds the maximal length of 72 characters.
fr: Votre mot de passe dépasse la taille maximale de 72 caractères.
hu: A jelszava meghaladja a 72 karakteres maximális hosszúságot.

source: Your password is too guessable:
fr: Votre mot de passe est trop facile à deviner :
hu: A jelszava túl könnyen kitalálható:

source: It would take an offline attacker %(time)s to guess it.
fr: Le deviner prendrait %(time)s à un attaquant qui aurait copié notre base de données.
hu: Egy offline támadónak ennyi időre lenne szüksége a feltöréséhez: körülbelül %(time)s.
nl: Het zou een offline aanvaller %(time)s kosten het te raden.
pt_br: Um ataque offline levaria %(time)s para adivinhá-la.

source: Warning:
fr: Attention :
hu: Figyelmeztetés:

source: Advice:
fr: Conseil :
hu: Tanács:

source: We expect nothing: you can use any password you want.
fr: Nous n’exigeons rien : vous pouvez utiliser n'importe quel mot de passe.
hu: Nem várunk el semmit: bármilyen jelszót használhat, amelyet szeretne.

source: We expect a password that cannot be guessed %s
fr: Nous demandons un mot de passe qui ne peut pas être deviné %s
hu: Olyan jelszót várunk, amelyet nem tudnak kitalálni %s

source: by your familly or friends.
fr: par votre famille ou vos amis.
hu: a családtagjai vagy barátai.
nl: door je familie of vrienden.
pt_br: por sua família ou amigos.

source: by attackers online.
fr: par des attaquants sur internet.
hu: az online támadók.
nl: door online aanvallers.
pt_br: por atacantes online.

source: without access to our database.
fr: à moins d'avoir accès à notre base de données.
hu: az adatbázisunkhoz való hozzáférés nélkül.
nl: zonder toegang tot onze database.
pt_br: sem acesso à nossa base de dados.

source: without a dedicated team and an access to our database.
fr: à moins d'avoir une équipe dédiée et un accès à notre base de données.
hu: vagy egy erre kijelölt csapat és az adatbázisunk elérése nélkül.
nl: zonder een toegewijd team en toegang tot onze database.
pt_br: sem uma equipe dedicada e com acesso à nossa base de dados.

source: There is no specific rule for a great password,
fr: Il n'y a pas de règle absolue pour un bon mot de passe,
hu: Nincs kifejezett szabály arra, hogy milyen egy kiváló jelszó,
nl: Er is geen specifieke regel voor een goed wachtwoord,
pt_br: Não existe uma regra específica para uma boa senha,

source: however if your password is too easy to guess,
fr: cependant si votre mot de passe est trop facile à deviner,
hu: azonban ha a jelszava túl könnyen kitalálható,
nl: maar als je wachtwoord te eenvoudig te raden is,
pt_br: porém se sua senha for muito fácil de adivinhar,

source: we will tell you how to make a better one.
fr: nous vous dirons comment l'améliorer.
hu: jelezni fogjuk, és tanácsot adunk, hogyan készíthet jobbat.
nl: zullen we je vertellen hoe je een beter wachtwoord kunt maken.
pt_br: nós daremos sugestões de como melhorá-la.
